Revit 2027 API
Form.IsReferenceOnlyProfile Method
Tell if the profile is made by referencing existing geometry in the Revit model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsReferenceOnlyProfile(
	int profileIndex
)
Public Function IsReferenceOnlyProfile (
	profileIndex As Integer
) As Boolean
public:
bool IsReferenceOnlyProfile(
	int profileIndex
)
member IsReferenceOnlyProfile :
        profileIndex : int -> bool
Parameters
profileIndex Int32
Index to specify the profile to be checked.
Return Value
Boolean
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace